simondlevy/Hackflight/extras/stm32f/boards/revo/revo.cpp
/*
   revo.cpp : Board implementation for OpenPilot CC3D Revolution 

   Copyright (C) 2018 Simon D. Levy 

   This file is part of Hackflight.

   Hackflight is free software: you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation, either version 3 of the License, or
   (at your option) any later version.

   Hackflight is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with Hackflight.  If not, see <http://www.gnu.org/licenses/>.
 */

#include "revo.h"

// Here we put code that interacts with Cleanflight
extern "C" {

#include "platform.h"

    // Cleanflight includes
#include "drivers/system.h"
#include "drivers/timer.h"
#include "drivers/time.h"
#include "drivers/light_led.h"
#include "drivers/serial.h"
#include "drivers/serial_uart.h"
#include "drivers/serial_usb_vcp.h"
#include "io/serial.h"
#include "target.h"
#include "stm32f4xx.h"

    // Hackflight includes
#include "../../common/spi.h"

    static serialPort_t * _serial0;

    Revo::Revo(void)
    {
        initMotors();
        initUsb();
        initImu();

        RealBoard::init();
    }

    void Revo::initImu(void)
    {
        spi_init(MPU6000_SPI_INSTANCE, IOGetByTag(IO_TAG(MPU6000_CS_PIN)));

        _imu = new MPU6000(MPUIMU::AFS_2G, MPUIMU::GFS_250DPS);

        switch (_imu->begin()) {

            case MPUIMU::ERROR_IMU_ID:
                error("Bad device ID");
                break;
            case MPUIMU::ERROR_SELFTEST:
                error("Failed self-test");
                break;
            default:
                break;
        }
    }

    void Revo::initUsb(void)
    {
        _serial0 = usbVcpOpen();
    }

    void Revo::initMotors(void)
    {

    }

    void Stm32FBoard::writeMotor(uint8_t index, float value)
    {
        (void)index;
        (void)value;
    }

    void Stm32FBoard::delaySeconds(float sec)
    {
        delay((uint16_t)(sec*1000));
    }

    void Stm32FBoard::setLed(bool isOn)
    {
        ledSet(0, isOn);
    }

    uint32_t Stm32FBoard::getMicroseconds(void)
    {
        return micros();
    }

    void Stm32FBoard::reboot(void)
    {
        systemResetToBootloader();
    }

    uint8_t Stm32FBoard::serialNormalAvailable(void)
    {
        return serialRxBytesWaiting(_serial0);
    }

    uint8_t Stm32FBoard::serialNormalRead(void)
    {
        return serialRead(_serial0);
    }

    void Stm32FBoard::serialNormalWrite(uint8_t c)
    {
        serialWrite(_serial0, c);
    }

    bool Stm32FBoard::getQuaternion(float quat[4])
    {
        return SoftwareQuaternionBoard::getQuaternion(quat, getTime());
    }

    bool Stm32FBoard::getGyrometer(float gyroRates[3])
    {
        return SoftwareQuaternionBoard::getGyrometer(gyroRates);
    }

    bool Revo::imuRead(void)
    {
        if (_imu->checkNewData()) {  

            _imu->readAccelerometer(_ax, _ay, _az);
            _imu->readGyrometer(_gx, _gy, _gz);

            // Negate to support board orientation
            _ay = -_ay;
            _gx = -_gx;
            _gz = -_gz;

            return true;
        }  

        return false;
    }

    void hf::Board::outbuf(char * buf)
    {
        for (char *p=buf; *p; p++)
            serialWrite(_serial0, *p);
    }

} // extern "C"
